RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_gpio.c
/*!
    \file    gd32h75e_gpio.c
    \brief   GPIO driver

    \version 2025-08-07, V1.2.0, firmware for GD32H75E
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32h75e_gpio.h"

/*!
    \brief      reset GPIO port
    \param[in]  gpio_periph: GPIOx(x = A,B,C,D,E,F,G,H,J,K)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C,D,E,F,G,H,J,K)
    \param[out] none
    \retval     none
*/
void gpio_deinit(uint32_t gpio_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0001U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(gpio_periph){
        case GPIOA:
            /* reset GPIOA */
            rcu_periph_reset_enable(RCU_GPIOARST);
            rcu_periph_reset_disable(RCU_GPIOARST);
            break;
        case GPIOB:
            /* reset GPIOB */
            rcu_periph_reset_enable(RCU_GPIOBRST);
            rcu_periph_reset_disable(RCU_GPIOBRST);
            break;
        case GPIOC:
            /* reset GPIOC */
            rcu_periph_reset_enable(RCU_GPIOCRST);
            rcu_periph_reset_disable(RCU_GPIOCRST);
            break;
        case GPIOD:
            /* reset GPIOD */
            rcu_periph_reset_enable(RCU_GPIODRST);
            rcu_periph_reset_disable(RCU_GPIODRST);
            break;
        case GPIOE:
            /* reset GPIOE */
            rcu_periph_reset_enable(RCU_GPIOERST);
            rcu_periph_reset_disable(RCU_GPIOERST);
            break;
        case GPIOF:
            /* reset GPIOF */
            rcu_periph_reset_enable(RCU_GPIOFRST);
            rcu_periph_reset_disable(RCU_GPIOFRST);
            break;
        case GPIOG:
            /* reset GPIOG */
            rcu_periph_reset_enable(RCU_GPIOGRST);
            rcu_periph_reset_disable(RCU_GPIOGRST);
            break;
        case GPIOH:
            /* reset GPIOH */
            rcu_periph_reset_enable(RCU_GPIOHRST);
            rcu_periph_reset_disable(RCU_GPIOHRST);
            break;
        case GPIOJ:
            /* reset GPIOJ */
            rcu_periph_reset_enable(RCU_GPIOJRST);
            rcu_periph_reset_disable(RCU_GPIOJRST);
            break;
        case GPIOK:
            /* reset GPIOK */
            rcu_periph_reset_enable(RCU_GPIOKRST);
            rcu_periph_reset_disable(RCU_GPIOKRST);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      set GPIO mode
    \param[in]  gpio_periph: GPIOx(x = A,B,C,D,E,F,G,H,J,K)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C,D,E,F,G,H,J,K)
    \param[in]  mode: gpio pin mode
                only one parameter can be selected which is shown as below:
      \arg        GPIO_MODE_INPUT: input mode
      \arg        GPIO_MODE_OUTPUT: output mode
      \arg        GPIO_MODE_AF: alternate function mode
      \arg        GPIO_MODE_ANALOG: analog mode
    \param[in]  pull_up_down: gpio pin with pull-up or pull-down resistor
                only one parameter can be selected which is shown as below:
      \arg        GPIO_PUPD_NONE: floating mode, no pull-up and pull-down resistors
      \arg        GPIO_PUPD_PULLUP: with pull-up resistor
      \arg        GPIO_PUPD_PULLDOWN:with pull-down resistor
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_mode_set(uint32_t gpio_periph, uint32_t mode, uint32_t pull_up_down, uint32_t pin)
{
    uint16_t i;
    uint32_t ctl, pupd;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0002U), ERR_PERIPH);
    }else if(NOT_GPIO_MODE(mode)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    }else if(NOT_GPIO_PULL_MODE(pull_up_down)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0002U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ctl = GPIO_CTL(gpio_periph);
        pupd = GPIO_PUD(gpio_periph);

        for(i = 0U;i < 16U;i++){
            if((1U << i) & pin){
                /* clear the specified pin mode bits */
                ctl &= ~GPIO_MODE_MASK(i);
                /* set the specified pin mode bits */
                ctl |= GPIO_MODE_SET(i, mode);

