RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_gpio.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0008U), ERR_PERIPH);
    }else if(NOT_FLITER_TYPE(iftype)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0008U), ERR_PARAM_INVALID);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0008U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        isperiod = GPIO_IFL(gpio_periph);
        if(pin & 0x000000FFU){
            isperiod &= ~GPIO_IFL_FLPRD0;
            isperiod |= (uint32_t)speriod;
        }    
        if(pin & 0x0000FF00U){
            isperiod &= ~GPIO_IFL_FLPRD1;
            isperiod |= ((uint32_t)speriod << 8U);
        }
        GPIO_IFL(gpio_periph) = isperiod;

        /* get the specified pin output speed bits value */
        iftp = GPIO_IFTP(gpio_periph);
        for(i = 0U;i < 16U;i++){
            if((1U << i) & pin){
                /* clear the specified pin output speed bits */
                iftp &= ~GPIO_IFTYPE_MASK(i);
                /* set the specified pin output speed bits */
                iftp |= GPIO_IFTYPE_SET(i,iftype);
            }
        }
        GPIO_IFTP(gpio_periph) = iftp;
    }
}

/*!
    \brief      get GPIO pin input status
    \param[in]  gpio_periph: GPIOx(x = A,B,C,D,E,F,G,H,J,K) 
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C,D,E,F,G,H,J,K) 
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus gpio_input_bit_get(uint32_t gpio_periph, uint32_t pin)
{
    FlagStatus reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0009U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0009U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((uint32_t)RESET != (GPIO_ISTAT(gpio_periph)&(pin))){
            reval = SET; 
        }else{
            reval = RESET;
        }
    }

    return reval;
}

/*!
    \brief      get GPIO port input status
    \param[in]  gpio_periph: GPIOx(x = A,B,C,D,E,F,G,H,J,K) 
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C,D,E,F,G,H,J,K) 
    \param[out] none
    \retval     state of GPIO all pins
*/
uint16_t gpio_input_port_get(uint32_t gpio_periph)
{
    uint16_t reval = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000AU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reval = ((uint16_t)GPIO_ISTAT(gpio_periph));
    }

    return reval;
}

/*!
    \brief      get GPIO pin output status
    \param[in]  gpio_periph: GPIOx(x = A,B,C,D,E,F,G,H,J,K) 
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C,D,E,F,G,H,J,K) 
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus gpio_output_bit_get(uint32_t gpio_periph, uint32_t pin)
{
    FlagStatus reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000BU), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000BU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((uint32_t)RESET != (GPIO_OCTL(gpio_periph)&(pin))){
            reval = SET;
        }else{
            reval = RESET;
        }
    }

return reval;
}

/*!
    \brief      get GPIO port output status
    \param[in]  gpio_periph: GPIOx(x = A,B,C,D,E,F,G,H,J,K) 
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C,D,E,F,G,H,J,K) 
    \param[out] none
    \retval     state of GPIO all pins
*/
uint16_t gpio_output_port_get(uint32_t gpio_periph)
{
    uint16_t reval = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000CU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reval = ((uint16_t)GPIO_OCTL(gpio_periph));
    }

    return reval;
}

/*!
    \brief      set GPIO alternate function
    \param[in]  gpio_periph: GPIOx(x = A,B,C,D,E,F,G,H,J,K) 
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C,D,E,F,G,H,J,K) 
    \param[in]  alt_func_num: GPIO pin af function, please refer to specific device datasheet
                only one parameter can be selected which is shown as below:
      \arg        GPIO_AF_0: SYSTEM, TIMER40, TIMER41, TIMER42, TIMER43, TIMER44
      \arg        GPIO_AF_1: TIMER0, TIMER1, TIMER15, TIMER16, EXMC
      \arg        GPIO_AF_2: TIMER2, TIMER3, TIMER4, TIMER7, TIMER14, CAN2, EXMC
      \arg        GPIO_AF_3: TIMER7, TIMER9, EDOUT, EXMC, HPDF, OSPIM
      \arg        GPIO_AF_4: TIMER14, I2C0, I2C1, I2C2, I2C3, USART0, HPDF, OSPIM
      \arg        GPIO_AF_5: SPI0, SPI1, SPI2, SPI3, SPI4, SPI5, CAN2
      \arg        GPIO_AF_6: UART3, SPI2, I2C3, HPDF, EDOUT, OSPIM
      \arg        GPIO_AF_7: USART0, USART1, USART2, USART5, UART6, TIMER40, TIMER41, TIMER42, TIMER43, 
                             SPI1, SPI2, SPI5, USBHS1
      \arg        GPIO_AF_8: UART3, UART4, UART7, SPI5, TIMER44, USBHS1
      \arg        GPIO_AF_9: TRGSEL, CAN0, CAN1, OPSIM, EXMC
      \arg        GPIO_AF_10: CMP, USBHS0, OPSIM, EXMC
      \arg        GPIO_AF_11: CMP, UART6, EXMC, HPDF, I2C3, OPSIM
      \arg        GPIO_AF_12: TIMER0, EXMC, OPSIM, CMP, USBHS1
      \arg        GPIO_AF_13: TRGSEL, COMP0, CMP, TIMER22
      \arg        GPIO_AF_14: UART4, TIMER23
      \arg        GPIO_AF_15: EVENTOUT
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_af_set(uint32_t gpio_periph, uint32_t alt_func_num, uint32_t pin)
{
    uint16_t i;
    uint32_t afrl, afrh;

