RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_gpio.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000DU), ERR_PERIPH);
    }else if(NOT_GPIO_AF(alt_func_num)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000DU), ERR_PARAM_INVALID);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000DU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        afrl = GPIO_AFSEL0(gpio_periph);
        afrh = GPIO_AFSEL1(gpio_periph);

        for(i = 0U;i < 8U;i++){
            if((1U << i) & pin){
                /* clear the specified pin alternate function bits */
                afrl &= ~GPIO_AFR_MASK(i);
                afrl |= GPIO_AFR_SET(i,alt_func_num);
            }
        }

        for(i = 8U;i < 16U;i++){
            if((1U << i) & pin){
                /* clear the specified pin alternate function bits */
                afrh &= ~GPIO_AFR_MASK(i - 8U);
                afrh |= GPIO_AFR_SET(i - 8U,alt_func_num);
            }
        }

        GPIO_AFSEL0(gpio_periph) = afrl;
        GPIO_AFSEL1(gpio_periph) = afrh;
    }
}

/*!
    \brief      lock GPIO pin bit
    \param[in]  gpio_periph: GPIOx(x = A,B,C,D,E,F,G,H,J,K) 
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C,D,E,F,G,H,J,K) 
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_pin_lock(uint32_t gpio_periph, uint32_t pin)
{
    uint32_t lock = 0x00010000U;
    lock |= pin;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000EU), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000EU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* lock key writing sequence: write 1->write 0->write 1->read 0->read 1 */
        GPIO_LOCK(gpio_periph) = (uint32_t)lock;
        GPIO_LOCK(gpio_periph) = (uint32_t)pin;
        GPIO_LOCK(gpio_periph) = (uint32_t)lock;
        lock = GPIO_LOCK(gpio_periph);
        lock = GPIO_LOCK(gpio_periph);
    }
}

/*!
    \brief      toggle GPIO pin status
    \param[in]  gpio_periph: GPIOx(x = A,B,C,D,E,F,G,H,J,K) 
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C,D,E,F,G,H,J,K)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_bit_toggle(uint32_t gpio_periph, uint32_t pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000FU), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000FU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_TG(gpio_periph) = (uint32_t)pin;
    }
}

/*!
    \brief      toggle GPIO port status
    \param[in]  gpio_periph: GPIOx(x = A,B,C,D,E,F,G,H,J,K)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C,D,E,F,G,H,J,K)
    \param[out] none
    \retval     none
*/
void gpio_port_toggle(uint32_t gpio_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0010U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_TG(gpio_periph) = 0x0000FFFFU;
    }
}
